b'[{"date": "2021-03-12T23:27:43Z", "title": "How to get HBO Max on an Amazon Fire Stick and watch shows like \'Game of Thrones\' or \'Friends\'", "fullArticle": "HBO\'s streaming service HBO Max has tons of hit series people love, like \\"Friends,\\" \\"Rick and Morty,\\" and \\"The Bachelor,\\" plus great originals like \\"Euphoria,\\" \\"Game of Thrones,\\" and \\"Last Week Tonight with John Oliver.\\" \\n                          \\nHBO Max\\n also offers tons of films to choose from on movie night \\u2014 there\'s something for everyone.Although Amazon experienced some difficulty partnering with competing streaming services, HBO Max finally arrived on Amazon devices in November 2020.You can download now HBO Max on Amazon Fire TVs, Fire Tablets, Fire Cubes, and Amazon Fire Sticks \\u2014 here\'s how.Once you\'ve got HBO Max on your Amazon device, check out our guides on how to make the most of the service\'s features.", "author": "insider@insider.com (Melanie Weir)"}, {"date": "2021-03-12T23:15:23Z", "title": "House Democrats kick off work on an infrastructure package after enacting Biden\'s stimulus plan", "fullArticle": "House Democrats said on Friday afternoon they have officially started work on an infrastructure package, kicking off what appears likely to be a lengthy stretch of negotiations on a multitrillion-dollar economic recovery bill.\\"Building our transportation system has long been bipartisan,\\" Speaker Nancy Pelosi said in a statement. \\"It is our hope that spirit will prevail as we address other critical needs in energy and broadband, education and housing, water systems and other priorities.\\"She went on: \\"As we engage in these job-creating initiatives, we must discuss their impact on the federal budget, on creating economic growth and on preserving our planet.\\"Rep. Richard Neal of Massachusetts, chair of the House Ways and Means Committee, said in a statement that Pelosi had instructed him to explore \\"how we can use the tax code to invest in modernizing and uplifting our communities while creating good jobs that will get Americans back on their feet.\\"", "author": "Joseph Zeballos-Roig"}, {"date": "2021-03-12T23:05:35Z", "title": "Here\'s how you\'ll get the 3rd stimulus check if you qualify", "fullArticle": "If you buy through our links, we may earn money from affiliate partners. Learn more.About 100 million stimulus checks will be delivered by March 24, President Joe Biden said on Monday.Most payments will arrive via direct deposit; others will be mailed as a paper check or a prepaid debit card.You need a Social Security number and income under $80,000 as a single filer or $160,000 as a joint filer to get a check. If you\'re married to someone who doesn\'t have a Social Security number and file taxes jointly, you\'re still eligible. And taxpayers who claim dependents of any age can also get up to $1,400 per person added to their check.", "author": "Tanza Loudenback"}, {"date": "2021-03-12T23:04:00Z", "title": "New York Senators Chuck Schumer and Kirsten Gillibrand say Gov. Andrew Cuomo \'should resign\'", "fullArticle": "New York\'s two Democratic US senators said Friday that Gov. Andrew Cuomo should step down amid allegations from six women that he engaged in sexual harassment.In a joint statement, Senate Majority Leader Chuck Schumer and Sen. Kirsten Gillibrand said Cuomo \\"should resign.\\"\\"Confronting and overcoming the COVID crisis requires sure and steady leadership,\\" the senators said, commending the women for coming forward with their \\"serious allegations of abuse and misconduct.\\"Calling their allegations \\"credible,\\" the senators said \\"it is clear that Governor Cuomo has lost the confidence of his governing partners and the people of New York.\\"", "author": "Charles Davis"}, {"date": "2021-03-12T22:55:26Z", "title": "How to cancel an Apple One subscription once you\'re done with the bundled subscription service", "fullArticle": "The Apple One bundle can combine up to six of its services into one subscription, and give you a discounted price on all of them. This allows you to subscribe to Apple Music, Apple TV Plus, Apple Arcade, and iCloud, plus you can get Apple News Plus and Apple Fitness Plus with the Premier plan. Apple also offers a free month to try the bundle.\\u00a0If you want to cancel Apple One during the free trial, or after the full subscription has begun, you need to know how. Fortunately, you can cancel through any device that lets you access your Apple ID Subscriptions page.Note that to cancel Apple One on a Mac like this, you\'ll first need to connect your Mac and Apple ID.", "author": "Ryan Ariano"}, {"date": "2021-03-12T22:37:42Z", "title": "The only difference between regular and high-yield savings that matters is the one that earns you 10 times more on your money", "fullArticle": "A savings account is a good place to save money for short-term goals like a down payment, a car, a vacation, or an emergency fund.But a high-yield savings account is a better place.\\n\\nHigh-yield savings accounts\\n are essentially the same as any other savings accounts, with one key difference: With a high-yield savings account, you earn about 10 times more interest on your money than you would with a regular savings account.Both types of accounts:", "author": "Liz Knueven"}, {"date": "2021-03-12T22:34:30Z", "title": "Walmart+ members can currently get free shipping on dozens of products during Walmart\'s Spring forward Rollback event", "fullArticle": "This story was created by the Insider Reviews Team in collaboration with Walmart+. We earn money from our partners.\\u00a0Learn more.\\nWhile many will adjust their clocks forward by an hour on Sunday, Walmart has been focusing on a different kind of rollback. All Walmart shoppers can currently save on hundreds of popular products during the Spring forward Rollback event.\\u00a0Though the rollbacks span across many different product categories, some of the best current deals are on major tech, home, and kitchen products. Chromebooks, earbuds, and air fryers are all seeing significant discounts. We\'ve profiled some of the best deals currently available below.\\u00a0", "author": "ehoffman@businessinsider.com (Insider Reviews Team,Walmart)"}, {"date": "2021-03-12T22:33:20Z", "title": "Manhattan prosecutors could be in the final stages of their wide-ranging investigation into Trump\'s finances", "fullArticle": "After a months-long battle with Donald Trump over his closely held tax returns, the Manhattan district attorney\'s office may finally be in the end stages of its wide-ranging investigation into the former president\'s financial dealings.Trump has repeatedly refused to release his tax returns. But in February, prosecutors notched a major victory when the Supreme Court forced Trump to hand over thousands of pages of his financial information to the DA\'s office.The DA\'s investigation is examining whether Trump or his businesses falsely reported the value of properties for tax and loan purposes, which would violate New York law. In the weeks since prosecutors obtained his financial records, the investigation has ramped up significantly, according to media reports and two former prosecutors who spoke to Insider.\\"They mean business now,\\" one source told The New Yorker\'s Jane Mayer. The person believed Manhattan district attorney Cyrus Vance Jr.\'s investigation had stagnated while Trump was in office and prosecutors were fighting a court battle to get his taxes. But now, the source told Mayer, prosecutors\' questions have become \\"very pointed \\u2014 they\'re sharpshooting now, laser-beaming.\\"", "author": "ssheth@businessinsider.com (Sonam Sheth,Jacob Shamsian)"}, {"date": "2021-03-12T22:17:15Z", "title": "Amazon has stopped selling books that frame LGBTQ+ identity as a mental illness (AMZN)", "fullArticle": "Amazon has stopped selling books that frame LGBTQ+ identity as a mental illness.\\u00a0Brian Huseman, Amazon\'s vice president of public policy, wrote a letter to four Republican senators confirming the online retailer stopped selling \\"When Harry Became Sally,\\" a book written by Ryan T. Anderson, a former fellow for the conservative think tank Heritage Foundation.Anderson\'s book, which says being transgender is a mental illness, was previously an Amazon bestseller.Huseman said in the letter, which was reviewed by Insider, that the platform does not have a \\"broad campaign\\" against conservative materials and offers customers content from a wide political spectrum. The Wall Street Journal first reported on the letter.", "author": "Allana Akhtar"}, {"date": "2021-03-12T21:57:46Z", "title": "The BlockFi Bitcoin credit card waitlist is open \\u2014 here\'s what to consider if you\'re thinking of applying", "fullArticle": "Personal Finance Insider writes about products, strategies, and tips to help you make smart decisions with your money. We may receive a small commission from our partners, like American Express, but our reporting and recommendations are always independent and objective.Pay with your credit card, and pay yourself back in bitcoin \\u2014 that\'s the value proposition of the new BlockFi Bitcoin Rewards Credit Card, which recently opened its waitlist to everyone. It\'s the first-ever credit card that replaces the traditional cash-back or miles-and-points rewards structure with the ability to rack up the cryptocurrency that appears on Elon Musk\'s Twitter bio.All purchases earn 1.5% back in bitcoin. So, spend $100, and you\'ll get $1.50 worth of bitcoin.\\u00a0As you continue to see Bitcoin in headlines everywhere you turn, should you apply to have one of these cards land in your mailbox? Weigh these key considerations before adding your name to the waitlist.", "author": "David McMillin"}, {"date": "2021-03-12T21:42:34Z", "title": "SEALs, Marines, and Norwegian soldiers teamed up with B-1B bombers to practice dropping bombs on new terrain", "fullArticle": "US Air Force B-1B Lancer bombers that deployed to Norway in late February have already demonstrated their reach in the air around Europe, and this week they tested their ability to put bombs on target in new surroundings.On March 8, a bomber conducted Joint Terminal Attack Controller training with US Navy SEALs, US Marines, and Norwegian soldiers near Setermoen in the Norwegian Arctic.JTACs, as they\'re known, direct aircraft during close-air-support missions. For this training, US and Norwegian JTACs took position \\"on top of a mountain and quickly established communications\\" with the bomber to call in targets, a Marine Corps release said.The exercise comes as NATO militaries have increased their focus on the European Arctic, conducting more ground, air, and naval operations there.", "author": "insider@insider.com (Christopher Woody)"}, {"date": "2021-03-12T21:33:35Z", "title": "How to watch Estrada vs. Chocolatito 2 on Saturday when the super flyweight champions meet in a unification rematch", "fullArticle": "If you buy through our links, we may earn money from affiliate partners. Learn more.Champions Juan Francisco Estrada and Rom\\u00e1n \\"Chocolatito\\" Gonz\\u00e1lez will fight to unify the WBC and WBA super flyweight titles on March 13. The match will be held in Dallas, Texas at the American Airlines Center, and will stream live on DAZN starting at 8 p.m. ET.Estrada and Gonz\\u00e1lez previously fought in 2012, when Gonz\\u00e1lez claimed the WBA light flyweight title in a unanimous decision. Throughout the eight years since their last meeting, the two fighters have only lost three matches between them, during a span where Thai boxer Srisaket Sor Rungvisai claimed the WBC title. Estrada reclaimed the WBC belt with a win over Sor Rungvisai in April 2019, while Gonz\\u00e1lez became the WBA title holder with a February 2020 win over Kal Yafai.On the undercard, Cecilia Braekhus will rematch Jessica McCaskill for a chance to regain her title as the world\'s undisputed women\'s welterweight champion. McCaskill handed Braekhus her first career loss in August 2020 and ended her streak of 25 consecutive title defenses, a record matched only by heavyweight legend Joe Louis.", "author": "kwebb@businessinsider.com (Kevin Webb)"}, {"date": "2021-03-12T21:26:15Z", "title": "Amazon is gearing up to launch its telehealth business for other companies and the rest of its US employees", "fullArticle": "Amazon is about to launch its \\n                          \\ntelehealth\\n offering for other employers and more Amazon employees throughout the country, two people familiar with the matter told Insider.Through a mobile app, Amazon Care offers online appointments with healthcare professionals, as well as home and worksite visits. To date, the service has been available only to Amazon employees in Washington state.\\u00a0That\'s starting to change. Insider reported in December that Amazon Care was undertaking a national expansion, with the goal of serving workers at other major companies. Care Medical, the group that runs Amazon Care\'s doctor\'s visits, has been quickly laying the groundwork to operate throughout the US. The group has filed with regulators to operate in at least 28 states, according to a review of state filings by Insider.Now Amazon Care is gearing up to go public with its ambitions, said the two people, who spoke on condition of anonymity because they were not authorized to speak with the press. The announcement could be days or weeks away, as the exact timing has not yet been determined.", "author": "Blake Dodge"}, {"date": "2021-03-12T21:25:36Z", "title": "Best tax software for small business owners: How TurboTax, TaxAct, and BlockAdvisors compare", "fullArticle": "Personal Finance Insider writes about products, strategies, and tips to help you make smart decisions with your money. We may receive a small commission from our partners, like American Express, but our reporting and recommendations are always independent and objective.If you own a small business, tax season can get hectic.Hiring an accountant to prepare and file your business taxes can save you time, but it\'s usually much cheaper to do it yourself online.To find the best online tax software for small business owners, we compared three of the leading online tax preparers \\u2014 TurboTax, TaxAct, and BlockAdvisors \\u2014 on price, accessibility, and ease of use.", "author": "Tanza Loudenback and Stephanie Hallett"}, {"date": "2021-03-12T21:15:49Z", "title": "Is it a crime to give away leftover COVID shots? Doctors and other healthcare workers fear legal consequences as they wait for Justice Department guidance.", "fullArticle": "Doctors and other healthcare workers are finding themselves straddling a confusing line between making sure no COVID vaccine goes to waste, and committing potential crimes if they give away unclaimed shots.\\u00a0When people don\'t show up for their vaccine appointments, pharmacists and doctors are stuck with extra doses that could end up in the trash if not used before their short shelf-life runs out.\\u00a0But there could be still-unclear legal consequences for giving those shots away, and a recent case in Texas served as a chilling reminder for the medical community.Months after the vaccines became available, the guidance remains unclear on when it\'s acceptable to give away those shots to the next available person who otherwise may not yet be eligible for their vaccine.\\u00a0", "author": "Camila DeChalus and Kimberly Leonard"}, {"date": "2021-03-12T21:10:23Z", "title": "Star NFL QB Patrick Mahomes says it was a \'no brainer\' for him to get into NFTs", "fullArticle": "The star NFL quarterback sat down with CNBC on Friday to discuss \\"The Museum of Mahomes,\\" which is set to launch March 17 on MakersPlace, a digital art selling platform.In the interview, Mahomes said he got into NFTs in order to \\"find another way to connect with my fans.\\" The Kansas City Chiefs star is teaming up with a group of artists who call themselves The Impossible Brief to put on an NFT sale.There will be six different art pieces for sale in the digital \\"museum\\" ranging in price from $2,500 to up to $15,000. The virtual exhibit will also include one mystery item that has yet to be priced.\\n\\n\\nTen signed helmets and jerseys will be given away to randomly selected winners who take part in the sale as well.", "author": "wdaniel@businessinsider.com (Will Daniel)"}, {"date": "2021-03-12T21:07:40Z", "title": "Dow closes at record high, tech falters as traders mull the impact of Biden\'s stimulus", "fullArticle": "The yield on the 10-year US Treasury note spiked to 1.64% on Friday, representing a new cycle high since the COVID-19 pandemic began.The spike in yields came after President Joe Biden signed his $1.9 trillion stimulus package into law, spurring inflationary concerns. Continued progress on the COVID-19 vaccine front also helped support higher bond yields as investors prepare for strong economic growth.Here\'s where US indexes stood at the 4 p.m. ET close on Friday:\\n\\n\\nRead more: Bank of America lays out 7 ways investors should start preparing portfolios before inflation jumps - and explains why to expect higher consumer prices and interest rates for the foreseeable future", "author": "mfox@businessinsider.com (Matthew Fox)"}, {"date": "2021-03-12T21:02:20Z", "title": "Former Theranos CEO Elizabeth Holmes is pregnant, and is requesting her federal trial be delayed again", "fullArticle": "Founder and former Theranos CEO Elizabeth Holmes is pregnant, according to new court documents.Holmes expects to give birth in July, and is requesting a delay to her federal trial, according to newly filed court documents. Both Holmes\' lawyers and the prosecution requested the trial\'s delay. If approved, she\'ll face trial for multiple federal charges of fraud starting on August 31.Holmes is accused of defrauding the company\'s investors out of millions of dollars after promising of a new type of blood test. That test was purported to perform a multitude of blood tests, able to detect everything from \\n                          \\nhigh cholesterol\\n to cancer, with a simple pin prick.\\u00a0The company raised over $700 million from investors on the promise of such a test. By August 2015, the FDA began investigating Theranos and found \\"major inaccuracies\\" in its tests.", "author": "Ben Gilbert"}, {"date": "2021-03-12T21:00:00Z", "title": "Why upgrading your workplace technology is the smartest investment for any business", "fullArticle": "Nationwide, nearly 80% of employees have something to say: They\'re frustrated.\\u00a0Very\\u00a0frustrated.New research conducted by OnePoll reveals the source of their unhappiness, and while it\'s not likely what you\'d expect, you\'re likely to relate. Their collective frustration stems from the outdated technology they have to use at work to do their work. Most of the time, it slows productivity; other times, it brings productivity to a halt.While we\'ve all been there \\u2014 flummoxed by one form of clunky tech or another, irritated with unintuitive software \\u2014 what\'s surprising is how seriously the surveyed employees take the issue. In fact, roughly 70% of them would be willing to take a pay cut in exchange for software and tech twice as good as what they currently use.Repeat:\\u00a0More than two-thirds are willing to take a pay cut. That\'s staggering.", "author": "Sponsor Post"}, {"date": "2021-03-12T20:58:22Z", "title": "Subway moves jobs from Connecticut headquarters to Miami, where the sandwich chain\'s CEO owns a home", "fullArticle": "Subway is shifting some of its workforce to Miami, Florida, where the chain\'s CEO owns a home.The chain told employees that it was moving several business units to Florida on Thursday, the New York Post reported. The Post reported that \\"at least some staffers were told that they would not be invited to Miami when the transition takes place in 2022.\\"\\u00a0A representative for Subway confirmed the report, telling Insider that the majority of the company\'s workforce will remain at its Milford, Connecticut headquarters.\\u00a0\\"We can confirm that some functional areas are moving to Miami,\\" Subway said in a statement. \\"These include more consumer-facing positions in marketing, culinary and some global transformation roles. This enables the brand to establish even more seamless collaboration with our supply chain organization, the Independent Purchasing Cooperative, which is also based in Miami.\\"", "author": "ktaylor@businessinsider.com (Kate Taylor)"}]'